{
  "projects": [
    {
      "name": "Attadabor fi Quran",
      "company": "Personal Project",
      "picture": "assets/projects/attadabor_fi_quran/",
      "overview": "Elevate your spiritual journey with Attadabor fi Quran, a unique meditation app merging personal reflections, community insights, and dynamic Quranic templates for a profound and personalized experience.",
      "description": "**Introducing Attadabor fi Quran: A Revolutionary Meditation and Reflection App**\n\nEmbark on a transformative journey with Attadabor fi Quran, a unique application designed to facilitate meditation and reflection on the profound verses of the Quran. This app goes beyond traditional Quranic applications, offering users a personalized and communal experience.\n\n**Personal Reflections:**\nInitiate your spiritual journey solo by adding personal reflections on specific words or verses. Your thoughts become a sacred space for introspection.\n\n**Community Connection:**\nTransition from solitude to community as you explore what others around the world are thinking about the same verses. Share your insights and connect with a global community of like-minded individuals.\n\n**Dynamic Vocabulary Integration:**\nEvery word added to \"My Dictionary\" becomes a beacon in your Quran reading. Witness the brilliance of your insights as the highlighted words guide your understanding and prompt updates.\n\n**Innovative Templates:**\nUnleash your creativity with customizable templates. Whether it's a template highlighting stories of prophets with distinct colors or a comprehensive categorization like the \"4 Columns\" template, the possibilities are endless. Achieve 100% coverage and organization of the Quran according to your unique perspective.\n\n**Effortless Search:**\nNavigate the vast Quran effortlessly by searching for specific words or characters. The app ensures a seamless exploration of the divine text.\n\n**Intuitive Navigation:**\nAccess any Surah quickly with the user-friendly navigation drawer. Experience fluid movement through the chapters of the Quran.\n**Audio Experience:**\nImmerse yourself in the beauty of the Quranic recitation. Play and listen to the verses, enhancing your connection with the divine message.\n\n**Data Management:**\nAttadabor fi Quran prioritizes user control. All your data is securely saved locally, and the app allows synchronization with your Notion database, providing a seamless experience across platforms.\n\n**Customization Features:**\nTailor your reading experience with customizable options. Adjust font family, font size, Quran presentation (cards, continuous, pages), and enable/disable dark mode. Choose your preferred translator for an enriched understanding, especially in card mode with included English translations.\n\nAttadabor fi Quran is not just an app; it's a companion on your spiritual journey, empowering you to engage with the Quran in a profound and personalized way. Elevate your meditation, reflection, and connection with the divine with this innovative application."
    },
    {
      "name": "BI Dashboard",
      "company": "Freelancing Project",
      "picture": "assets/projects/bi_dashboard/",
      "overview": "Revolutionize data analysis with BI Dashboard - a Flutter app seamlessly integrated with CubeJS. Unlock the power to create, save, and customize charts for the selling module, offering a user-centric interface and enhanced UI/UX.",
      "description": "**Presenting the BI Dashboard: Elevating Data Analysis with Flutter and CubeJS**\n\nEmbark on a data-driven journey with the BI Dashboard, a powerful Flutter application seamlessly integrated with CubeJS and your database. This freelancing opportunity allowed me to create an innovative solution for enhancing the selling module (Vente) by introducing a dynamic data analysis layer. The result? A user-friendly interface that empowers users to generate insightful charts with ease.\n\n\n**Key Features:**\n\n**1. Flutter and CubeJS Integration:**\nExperience the synergy of Flutter and CubeJS as they seamlessly link with your database. This integration forms the backbone of the BI Dashboard, providing a robust foundation for data analysis.\n\n**2. Selling Module Focus:**\nThe BI Dashboard narrows its focus to the selling module, allowing users to create charts specifically tailored to sales data. This targeted approach ensures a streamlined and efficient user experience.\n\n**3. Customizable Charts:**\nEmpower users with the ability to create personalized charts. The intuitive interface lets them set filters for chart type, measures, dimensions, segments, and time, giving them unparalleled control over their data representation.\n\n**4. Chart Persistence:**\nSay goodbye to repetitive chart creation. The BI Dashboard saves all charts for future reference, allowing users to effortlessly revisit and analyze their data. Users can also edit or delete charts based on evolving needs.\n\n**5. UI/UX Enhancements:**\nDrawing on client feedback, I implemented UI/UX enhancements to elevate the overall user experience. The result is an aesthetically pleasing and intuitive interface that ensures a smooth navigation experience.\n\n**6. Structural Improvements:**\nRecognizing the importance of maintainability, I focused on structuring the app for readability and future updates. The well-organized codebase ensures that the BI Dashboard remains a flexible and scalable solution.\n\n**7. Data Science with Flutter:**\nThis project offered a unique opportunity to explore the intersection of Flutter and Data Science. Leveraging CubeJS for the first time, I successfully integrated data analysis capabilities into the Flutter app, pushing the boundaries of what's possible.\n\n**8. Client-Centric Approach:**\nThe BI Dashboard isn't just a technical achievement; it's a client-centric solution tailored to meet specific needs. Every feature and enhancement was crafted with the end user in mind, ensuring a valuable and impactful tool.\n\nEmbark on a journey of data exploration with the BI Dashboard, where technology, design, and user-centricity converge to create a cutting-edge solution for data analysis within the selling module. This project stands as a testament to the possibilities that arise when Flutter meets the world of data science."
    },
    {
      "name": "Tesa Ranking",
      "company": "Community Project",
      "picture": "assets/projects/tesa_ranking/",
      "overview": "Test Ranking is the heartbeat of Tesa association's e-gaming community. A Flutter and NodeJS-powered mobile app centralizing news, tournaments, and player rankings, with upcoming Challonge API integration for seamless tournament management and enhanced user engagement.",
      "description": "**Introducing Test Ranking: Elevating E-Gaming Community Engagement**\n\nTest Ranking is not just an app; it's a testament to the collaborative spirit of the Tesa association's e-gaming community in the Arab Maghreb Union. Created with passion and commitment, this mobile application, developed in Flutter for the front end and powered by NodeJS for the back end, serves as a dynamic hub for all things Tesa-related.\n\n\n**Key Features:**\n\n**1. Centralized Data Hub:**\nTest Ranking consolidates Tesa association's vast array of information into one accessible platform. From news and events to tournaments, player biographies, rankings, and videos, users have a comprehensive view of the community's activities.\n\n**2. Intuitive Data Navigation:**\nEffortlessly explore Tesa's gaming universe with user-friendly features such as filtration by season (year), game type (global, regional, online), and game selection. Dive into the world of e-gaming with ease.\n\n**3. Challonge API Integration:**\nThe app is on the verge of a revolutionary upgrade with the upcoming integration of the Challonge API. Admins will now have the power to create and manage tournaments seamlessly within the app, promoting centralization and streamlining the entire tournament process.\n\n**4. Role-Based Access:**\nTest Ranking recognizes the diversity of its community members with three distinct roles. Standard users can update their scores, admins enjoy comprehensive access and validation capabilities, while newsCreators contribute their skills in news creation.\n\n**5. Enhanced User Engagement:**\nEmpowering players to update their scores directly within the app not only simplifies the process but also fosters increased user engagement. Admins can efficiently validate results, making the gaming experience more interactive and dynamic.\n\n**6. Learning NodeJS and Flutter Integration:**\nThe development journey was a learning experience in itself. Venturing into NodeJS for the back end and seamlessly integrating it with Flutter provided not only a robust technical foundation but also expanded the skill set of the development team.\n\n**7. Community Collaboration:**\nBeyond the lines of code, Test Ranking thrives on community collaboration. Monthly meetings for updates and brainstorming sessions foster a sense of togetherness, making the project not just a technical achievement but a communal success.\n\n**8. Volunteering at its Best:**\nTest Ranking is a testimony to the power of volunteerism. It goes beyond being a mere application; it's a contribution to a thriving e-gaming community, driven by the collective passion and dedication of its creators.\n\nTest Ranking is more than just a mobile app; it's a living, breathing entity that brings together the Tesa community. As the app continues to evolve, it stands as a beacon of innovation, collaboration, and the shared love for gaming within the Arab Maghreb Union."
    },
    {
      "name": "My Weekly Planner",
      "company": "Personal Project",
      "picture": "assets/projects/weekly_planner/",
      "overview": "My Weekly Planner is a comprehensive life organization app that simplifies task management and goal setting. Tailored for professionals, the app allows users to define and manage roles, plan their weekly schedule, and track daily progress. With features like role-based task organization, intuitive planning interfaces, and insightful statistics, this app empowers users to achieve their goals efficiently.",
      "description": "My Weekly Planner is more than just a task management app; it's a personalized life organizer designed to bring structure and efficiency to your daily routine.\n\n**My Roles:**\n The \"My Roles\" feature lets users categorize tasks based on predefined life roles, providing a unique perspective on priorities. From being a parent to a tech enthusiast, users can tailor roles to align with their diverse responsibilities.\n\n**My Weekly Planner:**\nThe \"My Weekly Planner\" screen serves as the central hub for planning the upcoming week. Users can set daily priorities, add tasks manually or from the inbox, and navigate future weeks for seamless planning. The app's intuitive design ensures that users can stay focused on their weekly objectives effortlessly.\n\n**My Day:**\nIn the \"My Day\" screen, users experience a focused view of their daily tasks, with highlighted priorities and a progress bar to motivate task completion. The ability to add, edit, and prioritize tasks, along with a quick glance at the next day's tasks, ensures flexibility and adaptability in daily planning.\n\n**Settings:**\nThe \"Settings\" screen provides a range of customization options, from language preferences to theme choices, catering to users' individual tastes. Features such as backup/restore, data sync, and notification management contribute to a personalized and secure user experience.\n\n**Statistics:**\nDive into insightful statistics with the \"Statistics\" screen, offering velocity charts, pie charts representing done tasks by role, and line charts tracking daily task commitments. These tools provide users with a visual representation of their progress, helping them stay motivated and committed to their goals.\n\nIn summary, My Weekly Planner goes beyond traditional task management, offering a holistic approach to life organization. With features for role-based task categorization, intuitive planning interfaces, customizable settings, and detailed statistics, this app is a valuable companion for anyone looking to enhance productivity and achieve their life goals."
    },
    {
      "name": "Randev",
      "company": "Future Proof",
      "picture": "assets/projects/randev/",
      "overview": "Randev is an innovative and user-friendly appointment management app designed to streamline scheduling for professionals and end consumers. Ideal for hairstylists, beauty salons, and driving lesson instructors, Randev simplifies the appointment process for businesses in these industries.",
      "description": "Randev redefines appointment management, providing a seamless solution for both professionals and consumers. Tailored for hairstylists, beauty salons, and driving lesson instructors, Randev offers a customizable profile creation feature for professionals. This includes detailed service listings, availability, and pricing, empowering consumers to browse profiles and find the perfect match for their needs.\n\n**Online Booking:**\nFacilitating direct appointment bookings through the app eliminates the need for phone calls or in-person interactions. The app boasts an intuitive calendar system, enabling professionals and consumers to effortlessly view and manage upcoming appointments from any device—be it a smartphone, tablet, or computer. The automatic synchronization of calendars prevents double bookings and ensures efficient appointment planning.\n\n**Chat with Customers:**\nRandev fosters easy communication between professionals and consumers through its built-in messaging feature. Both parties can exchange messages related to appointments, confirming details, asking questions, or making necessary adjustments. Professionals can also send reminders to clients before appointments, reducing no-shows and ensuring seamless scheduling. The reminder system can be configured for automatic client notifications.\n\n**In App Payment:**\nTo streamline transactions, Randev incorporates a secure payment system that allows consumers to pay for appointments directly through the app. Whether using credit cards, debit cards, or PayPal, the app supports various payment methods. The integrated receipt system further simplifies accounting for both professionals and consumers.\n\nIn summary, Randev is an all-in-one appointment management solution that simplifies the scheduling process for both professionals and consumers. With its user-friendly and intuitive interface, the app ensures a seamless experience for all parties involved."
    }
  ]
}
